src/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослевузовскоеОбразование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПослевузовскоеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УченаяСтепень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УченаяСтепень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименовниеУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФакультетИлиОтделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончанияИлиУхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсПриОкончанииИлиУходе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокМестРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцИГодПоступления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцИГодУхода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ЗаключениеАвтопроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ЗаключениеАвтопроверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пригласить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеНеНайдено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПослевузовскоеОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПослевузовскоеОбразование</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аспирантура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адъюнктура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Авторекомендация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Авторекомендация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеАвтопроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаключениеАвтопроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/БазовыеТребованияКВакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>БазовыеТребованияКВакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСтажПриНаличииОбразования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяУченаяСтепень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УченаяСтепень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/Заявка/Forms/ФормаДокументаКандидат/Ext/Form/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	#Область СозданиеДокументаАвторекомендаци
	РежимЗаписи     = РежимЗаписиДокумента.Запись;
	
	Авторекомендация = Документы.Авторекомендация.СоздатьДокумент();
	Авторекомендация.Дата = ТекущийОбъект.Дата;
	Авторекомендация.Заявка = ТекущийОбъект.Ссылка;
	
	ПравилоОтбора = Новый Структура("ДолжностьПоШтатномуРасписанию");
	ПравилоОтбора.ДолжностьПоШтатномуРасписанию = ТекущийОбъект.ЖелаемаяДолжность;
	ТребованияВыборка = Справочники.БазовыеТребованияКВакансии.Выбрать( , , ПравилоОтбора, );									  
		
	Если Не ТребованияВыборка.Следующий() Тогда
		Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.ТребованиеНеНайдено;
		Авторекомендация.Записать();
		Возврат;
	КонецЕсли;	
	
	Требования = ТребованияВыборка;
    #КонецОбласти

	#Область ПроверкаЗаявкиНаСоответствиеТребованиям
	Заявка = ТекущийОбъект;
		
	// Проверка наличия послевузовского образования
	Если Заявка.ПослевузовскоеОбразование = Перечисления.ПослевузовскоеОбразование.Нет Тогда
		// Проверка стажа 
		Если Заявка.Стаж < Требования.МинимальныйСтаж Тогда
			Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.Отказать;
			Авторекомендация.Записать();
			Возврат;
		КонецЕсли;
		
		// Вынести заключение и прекратить выполнение
		Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.Пригласить;
		Авторекомендация.Записать();
		Возврат;	
	КонецЕсли;
	
	// Проверка минимального стажа при наличии послевузовского образования
	Если Заявка.Стаж < Требования.МинимальныйСтажПриНаличииОбразования Тогда
		Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.Отказать;
		Авторекомендация.Записать();
		Возврат;
	КонецЕсли;
	
	// Проверка ученой степени
	ТребуемаяУченаяСтепень = ОбщиеФункцииПроцедуры.УченаяСтепеньВЧисло(Требования.МинимальнаяУченаяСтепень);
	УченаяСтепеньЗаявки    = ОбщиеФункцииПроцедуры.УченаяСтепеньВЧисло(Заявка.УченаяСтепень);
	
	Если УченаяСтепеньЗаявки < ТребуемаяУченаяСтепень Тогда
		Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.Отказать;
		Авторекомендация.Записать();
        Возврат;
	КонецЕсли;
	
	Авторекомендация.ЗаключениеАвтопроверки = Перечисления.ЗаключениеАвтопроверки.Пригласить;  
	#КонецОбласти
	
	Авторекомендация.Записать();
КонецПроцедуры             

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Pass		  
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Сообщить("Заявка отправлена! Можно закрыть это окно.", СтатусСообщения.Информация);
КонецПроцедуры                        

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Проведен Тогда
		Отказ = Истина;
		ПоказатьПредупреждение( , "Вы уже отправили заявку. Не переживайте мы ее рассматриваем!", 
								, "Повторная отправка заявки");   
		Возврат;	
	КонецЕсли;
	
	Если Объект.Образование.Количество() = 0 Тогда
		Отказ = Истина;
		ПоказатьПредупреждение( , "Укажите, пожалуйста, информацию об образовании.
								  |Сделать это можно на странице '" 
								+ Элементы.ГруппаОбразованиеИНачунаяДеятельность.Заголовок
								+ "' Спасибо!", 
								, "Вы кое-что забыли!");
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокМестРаботы.Количество() = 0 Тогда
		Отказ = Истина;
		ПоказатьПредупреждение( , "Укажите, пожалуйста, информацию о местах работы.
								  |Сделать это можно на странице '" 
								+ Элементы.ГруппаОбразованиеИНачунаяДеятельность.Заголовок
								+ "' Спасибо!", 
								, "Вы кое-что забыли!");
		Возврат;
	КонецЕсли;

	Если Объект.СогласиеНаОбработкуПД = Ложь Тогда
		Отказ = Истина;
		ПоказатьПредупреждение( , "Для подачи заявки необходимо дать согласие на обработку персональных данных.
								  |Сделать это можно на странице 'Формальности'. Спасибо!", 
								, "Вы кое-что забыли!");
		Возврат;
	КонецЕсли;
КонецПроцедуры

#Область БлокировкаФормыПослеПроведения
&НаСервере
Процедура ПроверитьВозможностьРедактирования()
	Если РедактированиеЗапрещено() Тогда
    	ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры // ЗаблокироватьОбъект()

&НаСервере
Функция РедактированиеЗапрещено()
	Возврат Объект.Проведен И Константы.ЗапретНаРедактированиеДокументов.Получить();
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	ПроверитьВозможностьРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтправить(Команда)
	КнопкаОтправитьНаСервере(); 
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Проведение, Ложь);
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура КнопкаОтправитьНаСервере()   
		
	
	//НоваяЗаявка = Документы.Заявка.СоздатьДокумент();
	//
	//НоваяЗаявка.Дата                      = ТекущаяДата();
	//НоваяЗаявка.Гражданство               = Объект.Гражданство;
	//НоваяЗаявка.ДатаРождения              = Объект.ДатаРождения;
	//НоваяЗаявка.ЖелаемаяДолжность         = Объект.ЖелаемаяДолжность;
	//НоваяЗаявка.ОСебе                     = Объект.ОСебе;
	//НоваяЗаявка.Пол                       = Объект.Пол;
	//НоваяЗаявка.ПолноеИмя                 = Объект.ПолноеИмя;
	//НоваяЗаявка.ПослевузовскоеОбразование = Объект.ПослевузовскоеОбразование;
	//НоваяЗаявка.СогласиеНаОбработкуПД     = Объект.СогласиеНаОбработкуПД;
	//НоваяЗаявка.Стаж                      = Объект.Стаж;
	//НоваяЗаявка.УченаяСтепень             = Объект.УченаяСтепень;
	//Для Каждого ТекСтрокаОбразование Из Объект.Образование Цикл
	//	НоваяСтрока = НоваяЗаявка.Образование.Добавить();
	//	НоваяСтрока.АдресУЗ = ТекСтрокаОбразование.АдресУЗ;
	//	НоваяСтрока.ГодОкончанияИлиУхода = ТекСтрокаОбразование.ГодОкончанияИлиУхода;
	//	НоваяСтрока.ГодПоступления = ТекСтрокаОбразование.ГодПоступления;
	//	НоваяСтрока.КурсПриОкончанииИлиУходе = ТекСтрокаОбразование.КурсПриОкончанииИлиУходе;
	//	НоваяСтрока.НаименовниеУЗ = ТекСтрокаОбразование.НаименовниеУЗ;
	//	НоваяСтрока.НомерДипломаУдостоверения = ТекСтрокаОбразование.НомерДипломаУдостоверения;
	//	НоваяСтрока.СерияДипломаУдостоверения = ТекСтрокаОбразование.СерияДипломаУдостоверения;
	//	НоваяСтрока.Специальность = ТекСтрокаОбразование.Специальность;
	//	НоваяСтрока.ФакультетИлиОтделение = ТекСтрокаОбразование.ФакультетИлиОтделение;
	//КонецЦикла;
	//Для Каждого ТекСтрокаСписокМестРаботы Из Объект.СписокМестРаботы Цикл
	//	НоваяСтрока = НоваяЗаявка.СписокМестРаботы.Добавить();
	//	НоваяСтрока.АдресОрганизации = ТекСтрокаСписокМестРаботы.АдресОрганизации;
	//	НоваяСтрока.Должность = ТекСтрокаСписокМестРаботы.Должность;
	//	НоваяСтрока.МесяцИГодПоступления = ТекСтрокаСписокМестРаботы.МесяцИГодПоступления;
	//	НоваяСтрока.МесяцИГодУхода = ТекСтрокаСписокМестРаботы.МесяцИГодУхода;
	//	НоваяСтрока.НаименованиеОрганизации = ТекСтрокаСписокМестРаботы.НаименованиеОрганизации;
	//КонецЦикла;
	//
	//НоваяЗаявка.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
#КонецОбласти

#КонецОбласти
